UT_Marketplaces.Marketplaces/src/DataProcessors/рар_мп_СопоставлениеТоваров/рар_мп_СопоставлениеТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>рар_мп_СопоставлениеТоваров</name>
</mdclass:DataProcessor>

UT_Marketplaces.Marketplaces/src/InformationRegisters/рар_мп_Wildberries_СопоставленныеТовары/рар_мп_Wildberries_СопоставленныеТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>рар_мп_Wildberries_СопоставленныеТовары</name>
  <resources>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </resources>
  <attributes>
    <name>Размер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеТовара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IDРазмера</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>30</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВозможностьСменыЦенДляРазмеров</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Аккаунт</name>
    <type>
      <types>CatalogRef.рар_мп_АккаунтыМаркетплейсов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>IDТовара</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>30</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Баракод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

UT_Marketplaces.Marketplaces/src/InformationRegisters/рар_мп_ЯндексМаркет_СопоставленныеТовары/рар_мп_ЯндексМаркет_СопоставленныеТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>рар_мп_ЯндексМаркет_СопоставленныеТовары</name>
  <resources>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </resources>
  <attributes>
    <name>НаименованиеТовара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SKUЯндексМаркета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Аккаунт</name>
    <type>
      <types>CatalogRef.рар_мп_АккаунтыМаркетплейсов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>SKUТовара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

UT_Marketplaces.Marketplaces/src/InformationRegisters/рар_мп_Ozon_СопоставленныеТовары/рар_мп_Ozon_СопоставленныеТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>рар_мп_Ozon_СопоставленныеТовары</name>
  <resources>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </resources>
  <attributes>
    <name>НаименованиеТовара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Аккаунт</name>
    <type>
      <types>CatalogRef.рар_мп_АккаунтыМаркетплейсов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>IDТовара</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>30</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>SKUТовара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

UT_Marketplaces.Marketplaces/src/Enums/рар_мп_Маркетплейсы/рар_мп_Маркетплейсы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>рар_мп_Маркетплейсы</name>
  <enumValues>
    <name>OZON</name>
  </enumValues>
  <enumValues>
    <name>ЯндексМаркет</name>
  </enumValues>
  <enumValues>
    <name>Wildberries</name>
  </enumValues>
</mdclass:Enum>

UT_Marketplaces.Marketplaces/src/DataProcessors/рар_мп_СопоставлениеТоваров/Forms/Форма/Module.bsl
#Область СлужебныеПроцедурыИФункцииДляПроверкиПЛС

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ПриПовторномОткрытииНаСервере() = Ложь Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru='Вы не приняли лицензионное соглашение 1С-Рарус, функционал расширения не доступен'");
		Сообщение.Сообщить();
		ЭтотОбъект.Закрыть();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПриПовторномОткрытииНаСервере()
	Возврат Константы.рар_мп_Согласие.Получить();
КонецФункции

&НаКлиенте
Процедура ПриПовторномОткрытии()
	Если ПриПовторномОткрытииНаСервере() = Ложь Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru='Вы не приняли лицензионное соглашение 1С-Рарус, функционал расширения не доступен'");
		Сообщение.Сообщить();
		ЭтотОбъект.Закрыть();
	КонецЕсли;
КонецПроцедуры  

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура АккаунтПриИзмененииНаСервере()
	
	ТоварыКСопоставлению.Очистить();
	СопоставленныеТовары.Очистить();
	
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(АккаунтМаркетплейса, "Маркетплейс") = Перечисления.рар_мп_Маркетплейсы.Wildberries Тогда
	
		Элементы.ТоварыКСопоставлению.ПодчиненныеЭлементы.ТоварыКСопоставлениюБаракод.Видимость = Истина;
		Элементы.ТоварыКСопоставлению.ПодчиненныеЭлементы.ТоварыКСопоставлениюРазмер.Видимость  = Истина;
		
		Элементы.СопоставленныеТовары.ПодчиненныеЭлементы.СопоставленныеТоварыБаракод.Видимость = Истина;
	    Элементы.СопоставленныеТовары.ПодчиненныеЭлементы.СопоставленныеТоварыРазмер.Видимость  = Истина;
		
		Элементы.ТоварыКСопоставлению.ПодчиненныеЭлементы.ТоварыКСопоставлениюSKUТовара.Видимость = Ложь;
		Элементы.СопоставленныеТовары.ПодчиненныеЭлементы.СопоставленныеТоварыSKUТовара.Видимость = Ложь;
		
		Элементы.ТоварыКСопоставлению.ПодчиненныеЭлементы.ТоварыКСопоставлениюSKUЯндексМаркета.Видимость = Ложь;
		Элементы.СопоставленныеТовары.ПодчиненныеЭлементы.СопоставленныеТоварыSKUЯндексМаркета.Видимость = Ложь;
		
		Элементы.ТоварыКСопоставлению.ПодчиненныеЭлементы.ТоварыКСопоставлениюIDТовара.Видимость = Истина;
		Элементы.СопоставленныеТовары.ПодчиненныеЭлементы.СопоставленныеТоварыIDТовара.Видимость = Истина;
		
		Элементы.ТоварыКСопоставлению.ПодчиненныеЭлементы.ТоварыКСопоставлениюIDРазмера.Видимость = Истина;
		Элементы.СопоставленныеТовары.ПодчиненныеЭлементы.СопоставленныеТоварыIDРазмера.Видимость = Истина;
		
	ИначеЕсли ОбщегоНазначения.ЗначениеРеквизитаОбъекта(АккаунтМаркетплейса, "Маркетплейс") = Перечисления.рар_мп_Маркетплейсы.ЯндексМаркет Тогда
		
		Элементы.ТоварыКСопоставлению.ПодчиненныеЭлементы.ТоварыКСопоставлениюБаракод.Видимость = Истина;
		Элементы.ТоварыКСопоставлению.ПодчиненныеЭлементы.ТоварыКСопоставлениюРазмер.Видимость  = Ложь;
		
		Элементы.СопоставленныеТовары.ПодчиненныеЭлементы.СопоставленныеТоварыБаракод.Видимость = Ложь;
	    Элементы.СопоставленныеТовары.ПодчиненныеЭлементы.СопоставленныеТоварыРазмер.Видимость  = Ложь;
		
		Элементы.ТоварыКСопоставлению.ПодчиненныеЭлементы.ТоварыКСопоставлениюIDТовара.Видимость = Ложь;
		Элементы.СопоставленныеТовары.ПодчиненныеЭлементы.СопоставленныеТоварыIDТовара.Видимость = Ложь;
		
		Элементы.ТоварыКСопоставлению.ПодчиненныеЭлементы.ТоварыКСопоставлениюSKUТовара.Видимость = Истина;
		Элементы.СопоставленныеТовары.ПодчиненныеЭлементы.СопоставленныеТоварыSKUТовара.Видимость = Истина;
		
		Элементы.ТоварыКСопоставлению.ПодчиненныеЭлементы.ТоварыКСопоставлениюIDРазмера.Видимость = Ложь;
		Элементы.СопоставленныеТовары.ПодчиненныеЭлементы.СопоставленныеТоварыIDРазмера.Видимость = Ложь;
		
		Элементы.ТоварыКСопоставлению.ПодчиненныеЭлементы.ТоварыКСопоставлениюSKUЯндексМаркета.Видимость = Истина;
		Элементы.СопоставленныеТовары.ПодчиненныеЭлементы.СопоставленныеТоварыSKUЯндексМаркета.Видимость = Истина;
			
	ИначеЕсли ОбщегоНазначения.ЗначениеРеквизитаОбъекта(АккаунтМаркетплейса, "Маркетплейс") = Перечисления.рар_мп_Маркетплейсы.OZON Тогда
	
		Элементы.ТоварыКСопоставлению.ПодчиненныеЭлементы.ТоварыКСопоставлениюБаракод.Видимость = Истина;
		Элементы.ТоварыКСопоставлению.ПодчиненныеЭлементы.ТоварыКСопоставлениюРазмер.Видимость  = Ложь;
		
		Элементы.СопоставленныеТовары.ПодчиненныеЭлементы.СопоставленныеТоварыБаракод.Видимость = Ложь;
	    Элементы.СопоставленныеТовары.ПодчиненныеЭлементы.СопоставленныеТоварыРазмер.Видимость  = Ложь;
		
		Элементы.ТоварыКСопоставлению.ПодчиненныеЭлементы.ТоварыКСопоставлениюSKUТовара.Видимость = Истина;
		Элементы.СопоставленныеТовары.ПодчиненныеЭлементы.СопоставленныеТоварыSKUТовара.Видимость = Истина;
		
		Элементы.ТоварыКСопоставлению.ПодчиненныеЭлементы.ТоварыКСопоставлениюIDТовара.Видимость = Истина;
		Элементы.СопоставленныеТовары.ПодчиненныеЭлементы.СопоставленныеТоварыIDТовара.Видимость = Истина;
		
		Элементы.ТоварыКСопоставлению.ПодчиненныеЭлементы.ТоварыКСопоставлениюIDРазмера.Видимость = Ложь;
		Элементы.СопоставленныеТовары.ПодчиненныеЭлементы.СопоставленныеТоварыIDРазмера.Видимость = Ложь;
		
		Элементы.ТоварыКСопоставлению.ПодчиненныеЭлементы.ТоварыКСопоставлениюSKUЯндексМаркета.Видимость = Ложь;
		Элементы.СопоставленныеТовары.ПодчиненныеЭлементы.СопоставленныеТоварыSKUЯндексМаркета.Видимость = Ложь;

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АккаунтПриИзменении(Элемент)
	АккаунтПриИзмененииНаСервере();
КонецПроцедуры 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	рар_мп_УправлениеЭлементамиФормыКлиентСервер.УстановитьСвязиПараметровВыбораХарактеристикиИУпаковки(ЭтотОбъект, "ТоварыКСопоставлению","ТоварыКСопоставлениюХарактеристика","ТоварыКСопоставлениюУпаковка");
	
	//Добавил kolchs
	Если Параметры.Свойство("АккаунтМаркетплейса") Тогда
		
		Если ЗначениеЗаполнено(Параметры.АккаунтМаркетплейса) Тогда
		
			АккаунтМаркетплейса = Параметры.АккаунтМаркетплейса;
			АккаунтПриИзмененииНаСервере();
		
		КонецЕсли;	
		
	КонецЕсли;	


КонецПроцедуры

&НаКлиенте
Процедура ТоварыКСопоставлениюНоменклатураПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.ТоварыКСопоставлению.ТекущиеДанные;
	
	ТекущаяСтрока.ИзменитьПозицию = Истина;
КонецПроцедуры

#КонецОбласти 

#Область КнопкиУстановкиИСнятияГалочек

&НаКлиенте
Процедура ВыбратьВсеСтроки(Команда)
	
	Если Элементы.ГруппаТоварыКСопоставлениюИСопоставленныеТовары.ТекущаяСтраница.Имя = "ГруппаТоварыКСопоставлению" Тогда
	
		Для каждого Стр Из ТоварыКСопоставлению Цикл
		
			Стр.ИзменитьПозицию = Истина;	
		
		КонецЦикла;	
	
	Иначе
	
		Для каждого Стр Из СопоставленныеТовары Цикл
		
			Стр.ИзменитьПозицию = Истина;	
		
		КонецЦикла;	
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВыделениеВсехСтрок(Команда)
	
	Если Элементы.ГруппаТоварыКСопоставлениюИСопоставленныеТовары.ТекущаяСтраница.Имя = "ГруппаТоварыКСопоставлению" Тогда
	
		Для каждого Стр Из ТоварыКСопоставлению Цикл
		
			Стр.ИзменитьПозицию = Ложь;	
		
		КонецЦикла;	
	
	Иначе
	
		Для каждого Стр Из СопоставленныеТовары Цикл
		
			Стр.ИзменитьПозицию = Ложь;	
		
		КонецЦикла;	
	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область УдалениеСопоставленияТоваров

&НаКлиенте
Процедура УдалитьСопоставлениеТоваров(Команда)
	
	Если ПроверитьЗаполнение() Тогда
	
		ДлительнаяОперация     = УдалитьСопоставлениеТоваровНаСервере();
		ПараметрыОжидания      = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьСообщения = Истина;
		ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
		ПараметрыОжидания.ТекстСообщения = "Удаление сопоставления ...";
		Оповещение = Новый ОписаниеОповещения("ЗавершениеУдаленияСопоставления", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);	
	
	КонецЕсли;

	
	
КонецПроцедуры

&НаСервере
Функция УдалитьСопоставлениеТоваровНаСервере()
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор); 
			
	ВозвратныеДанные = ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, 
		"рар_мп_СопоставлениеТоваров.УдалениеСопоставления", СопоставленныеТовары.Выгрузить(), АккаунтМаркетплейса);
		
	Возврат ВозвратныеДанные;		
	
КонецФункции

&НаКлиенте
Процедура ЗавершениеУдаленияСопоставления(Результат, СтруктураПараметров) Экспорт
	
    Если Результат = НЕОПРЕДЕЛЕНО Тогда
	
		Возврат;	
	
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
	
		ЗавершениеУдаленияСопоставленияНаСервере(Результат);
		
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон("Ошибка при удалении сопоставления. Описание ошибки: %1", Результат.КраткоеПредставлениеОшибки);
		Сообщение.Сообщить();
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗавершениеУдаленияСопоставленияНаСервере(Результат)
	
	ТЗ = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	
	Попытка
	
		СопоставленныеТовары.Загрузить(ТЗ);
	
	Исключение
		
		ОбщегоНазначения.СообщитьПользователю("Ошибка при удалении сопоставленных товаров из табличной части. Подробное описание ошибки можно посмотреть в журнале регистрации");
		
		ЗаписьЖурналаРегистрации("Ошибка при удалении сопоставленных товаров из табличной части", УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки(),);
		
	КонецПопытки;
	
	
КонецПроцедуры

#КонецОбласти

#Область СохранениеСопоставления

&НаСервере
Функция СохранитьСопоставлениеНаСервере()
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор); 
			
	ВозвратныеДанные = ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, 
		"рар_мп_СопоставлениеТоваров.СохранениеСопоставления", ТоварыКСопоставлению.Выгрузить(), АккаунтМаркетплейса);
		
	Возврат ВозвратныеДанные;	
	
КонецФункции 

&НаКлиенте
Процедура СохранитьСопоставление(Команда)

	Если ПроверитьЗаполнение() Тогда
		
		ДлительнаяОперация     = СохранитьСопоставлениеНаСервере();
		ПараметрыОжидания      = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьСообщения = Истина;
		ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
		ПараметрыОжидания.ТекстСообщения = "Сохранение сопоставления ...";
		Оповещение = Новый ОписаниеОповещения("ЗавершениеСопоставления", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);	
	
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеСопоставления(Результат, СтруктураПараметров) Экспорт
	
    Если Результат = НЕОПРЕДЕЛЕНО Тогда
	
		Возврат;	
	
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
	
		ЗавершениеСопоставленияНаСервере(Результат);
		
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон("Ошибка при сохранении сопоставления. Описание ошибки: %1", Результат.КраткоеПредставлениеОшибки);
		Сообщение.Сообщить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗавершениеСопоставленияНаСервере(Результат)
	
	ТЗ = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	
	Попытка
	
		ТоварыКСопоставлению.Загрузить(ТЗ);
	
	Исключение
		
		ОбщегоНазначения.СообщитьПользователю("Ошибка при удалении товаров к сопоставлению из табличной части . Подробное описание ошибки можно посмотреть в журнале регистрации");
		
		ЗаписьЖурналаРегистрации("Ошибка при удалении товаров к сопоставлению из табличной части", УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки(),);
		
	КонецПопытки;
	
	
КонецПроцедуры

#КонецОбласти   

#Область ЗагрузкаСопоставленныхТоваров

&НаКлиенте
Процедура ЗагрузитьСопоставленныеТовары(Команда)
	
	Если ПроверитьЗаполнение() Тогда
	
		ЗагрузитьСопоставленныеТоварыНаСервере();	
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьСопоставленныеТоварыНаСервере()

	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(АккаунтМаркетплейса, "Маркетплейс") = Перечисления.рар_мп_Маркетплейсы.Wildberries Тогда
				
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	рар_мп_Wildberries_СопоставленныеТовары.Аккаунт КАК Аккаунт,
			|	рар_мп_Wildberries_СопоставленныеТовары.IDТовара КАК IDТовара,
			|	рар_мп_Wildberries_СопоставленныеТовары.Артикул КАК Артикул,
			|	рар_мп_Wildberries_СопоставленныеТовары.Баракод КАК Баракод,
			|	рар_мп_Wildberries_СопоставленныеТовары.Размер КАК Размер,
			|	рар_мп_Wildberries_СопоставленныеТовары.Номенклатура КАК Номенклатура,
			|	рар_мп_Wildberries_СопоставленныеТовары.Характеристика КАК Характеристика,
			|	рар_мп_Wildberries_СопоставленныеТовары.Упаковка КАК Упаковка,
			|	рар_мп_Wildberries_СопоставленныеТовары.НаименованиеТовара КАК НаименованиеТовара
			|ИЗ
			|	РегистрСведений.рар_мп_Wildberries_СопоставленныеТовары КАК рар_мп_Wildberries_СопоставленныеТовары
			|ГДЕ
			|	рар_мп_Wildberries_СопоставленныеТовары.Аккаунт = &Аккаунт";	
		
	ИначеЕсли ОбщегоНазначения.ЗначениеРеквизитаОбъекта(АккаунтМаркетплейса, "Маркетплейс") = Перечисления.рар_мп_Маркетплейсы.ЯндексМаркет  Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	рар_мп_ЯндексМаркет_СопоставленныеТовары.Аккаунт КАК Аккаунт,
			|	рар_мп_ЯндексМаркет_СопоставленныеТовары.SKUТовара КАК SKUТовара,
			|	рар_мп_ЯндексМаркет_СопоставленныеТовары.Артикул КАК Артикул,
			|	рар_мп_ЯндексМаркет_СопоставленныеТовары.Номенклатура КАК Номенклатура,
			|	рар_мп_ЯндексМаркет_СопоставленныеТовары.Характеристика КАК Характеристика,
			|	рар_мп_ЯндексМаркет_СопоставленныеТовары.Упаковка КАК Упаковка,
			|	рар_мп_ЯндексМаркет_СопоставленныеТовары.НаименованиеТовара КАК НаименованиеТовара
			|ИЗ
			|	РегистрСведений.рар_мп_ЯндексМаркет_СопоставленныеТовары КАК рар_мп_ЯндексМаркет_СопоставленныеТовары
			|ГДЕ
			|	рар_мп_ЯндексМаркет_СопоставленныеТовары.Аккаунт = &Аккаунт";
		
	ИначеЕсли ОбщегоНазначения.ЗначениеРеквизитаОбъекта(АккаунтМаркетплейса, "Маркетплейс") = Перечисления.рар_мп_Маркетплейсы.OZON  Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	рар_мп_Ozon_СопоставленныеТовары.Аккаунт КАК Аккаунт,
			|	рар_мп_Ozon_СопоставленныеТовары.IDТовара КАК IDТовара,
			|	рар_мп_Ozon_СопоставленныеТовары.SKUТовара КАК SKUТовара,
			|	рар_мп_Ozon_СопоставленныеТовары.Артикул КАК Артикул,
			|	рар_мп_Ozon_СопоставленныеТовары.Номенклатура КАК Номенклатура,
			|	рар_мп_Ozon_СопоставленныеТовары.Характеристика КАК Характеристика,
			|	рар_мп_Ozon_СопоставленныеТовары.Упаковка КАК Упаковка,
			|	рар_мп_Ozon_СопоставленныеТовары.НаименованиеТовара КАК НаименованиеТовара
			|ИЗ
			|	РегистрСведений.рар_мп_Ozon_СопоставленныеТовары КАК рар_мп_Ozon_СопоставленныеТовары
			|ГДЕ
			|	рар_мп_Ozon_СопоставленныеТовары.Аккаунт = &Аккаунт";
							
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Аккаунт", АккаунтМаркетплейса);
	
	РезультатЗапроса = Запрос.Выполнить(); 
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
	
		Выборка = РезультатЗапроса.Выгрузить();
		
		Попытка
		
			СопоставленныеТовары.Загрузить(Выборка);
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Загрузка сопоставленных товаров завершена";
			Сообщение.Сообщить();
		
		Исключение
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Ошибка при загрузке сопоставленных товаров. Подробное описание ошибки можно посмотреть в журнале регистрации";
			Сообщение.Сообщить();
			
			ЗаписьЖурналаРегистрации("Ошибка при загрузке сопоставленных товаров", УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки(),);
		
		КонецПопытки;
		
	Иначе
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Загрузка завершена. В базе нет сопоставленных товаров для выбранного аккаунта и склада";
		Сообщение.Сообщить();
	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ЗагрузаТоваровКСопоставлению

&НаКлиенте
Процедура ЗагрузитьТоварыКСопоставлению(Команда)
	
	Если ПроверитьЗаполнение() Тогда
	
		ТоварыКСопоставлению.Очистить();
		
		ДлительнаяОперация     = ЗагрузитьТоварыКСопоставлениюНаСервере();
		ПараметрыОжидания      = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьСообщения = Истина;
		ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
		ПараметрыОжидания.ТекстСообщения = "Получение товаров из маркетплейса ...";
		Оповещение = Новый ОписаниеОповещения("ЗавершениеЗагрузкиТоваровКСопоставлению", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания); 
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗагрузитьТоварыКСопоставлениюНаСервере()
	
	Маркетплейс = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(АккаунтМаркетплейса, "Маркетплейс");
	
	Если Маркетплейс = Перечисления.рар_мп_Маркетплейсы.Ozon Тогда
		
		ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор); 
			
		ВозвратныеДанные = ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, 
			"рар_мп_СопоставлениеТоваров.ПолучитьСписокТоваровКСопоставлению_Ozon", АккаунтМаркетплейса);
			
		Возврат ВозвратныеДанные;

		
	ИначеЕсли Маркетплейс = Перечисления.рар_мп_Маркетплейсы.ЯндексМаркет Тогда
		
		ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор); 
			
		ВозвратныеДанные = ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, 
			"рар_мп_СопоставлениеТоваров.ПолучитьСписокТоваровКСопоставлению_ЯндексМаркет", АккаунтМаркетплейса);
			
		Возврат ВозвратныеДанные;
			
		
	ИначеЕсли Маркетплейс = Перечисления.рар_мп_Маркетплейсы.Wildberries Тогда 
		
		ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор); 
		
    	ВозвратныеДанные = ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, 
        	"рар_мп_СопоставлениеТоваров.ПолучитьСписокТоваровКСопоставлению_Wildberries",АккаунтМаркетплейса);
	
				
		 Возврат ВозвратныеДанные;
		
	КонецЕсли;   
	
КонецФункции

&НаСервере
Процедура ЗавершениеЗагрузкиТоваровКСопоставлениюНаСервере(Результат)
	
	ТЗ = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	
	Попытка
	
		ТоварыКСопоставлению.Загрузить(ТЗ);
		
		
		Если ТоварыКСопоставлению.Количество() = 0 Тогда
			
			ОбщегоНазначения.СообщитьПользователю("Для данного аккаунта нет товаров для сопоставления");
			
		Иначе
			
			ОбщегоНазначения.СообщитьПользователю("Загрузка товаров завершена");
		
		КонецЕсли;
	
	Исключение
		
		ОбщегоНазначения.СообщитьПользователю("Ошибка при загрузке товаров из маркетплейса. Подробное описание ошибки можно посмотреть в журнале регистрации");
		
		ЗаписьЖурналаРегистрации("Ошибка при загрузке товаров из маркетплейса в табличную часть", УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки(),);
		
	КонецПопытки;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеЗагрузкиТоваровКСопоставлению(Результат, СтруктураПараметров) Экспорт
	
    Если Результат = НЕОПРЕДЕЛЕНО Тогда
	
		Возврат;	
	
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
	
		ЗавершениеЗагрузкиТоваровКСопоставлениюНаСервере(Результат);
		
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон("Ошибка при загрузке товаров к сопоставлению. Описание ошибки: %1", Результат.КраткоеПредставлениеОшибки);
		Сообщение.Сообщить();

	КонецЕсли;
	
КонецПроцедуры
	
#КонецОбласти

#Область СопоставлениеПоАртикулу

&НаКлиенте
Процедура СопоставитьПоАртикулу(Команда)
	Если ТоварыКСопоставлению.Количество() <> 0 Тогда
		
		ДлительнаяОперация     = СопоставитьПоАртикулуНаСервере();
		ПараметрыОжидания      = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьСообщения = Истина;
		ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
		ПараметрыОжидания.ТекстСообщения = "Сопоставление по артикулу ...";
		Оповещение = Новый ОписаниеОповещения("ЗавершениеСопоставленияПоАртикулу", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);	
		
	Иначе
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Перед сопоставлением по артикулу необходимо загрузить товары к сопоставлению";
		Сообщение.Сообщить();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция СопоставитьПоАртикулуНаСервере()
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор); 
			
	ВозвратныеДанные = ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, 
		"рар_мп_СопоставлениеТоваров.СопоставлениеПоАртикулу", ТоварыКСопоставлению.Выгрузить(), АккаунтМаркетплейса);
		
	Возврат ВозвратныеДанные;	
	
КонецФункции

&НаКлиенте
Процедура ЗавершениеСопоставленияПоАртикулу(Результат, СтруктураПараметров) Экспорт
	
    Если Результат = НЕОПРЕДЕЛЕНО Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Ошибка при сопоставлении по артикулу";
		Сообщение.Сообщить();
		
		Возврат;	
	
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
	
		ЗавершениеСопоставленияПоАртикулуНаСервере(Результат);	
		
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон("Ошибка при сопоставлении по артикулу. Описание ошибки: %1", Результат.КраткоеПредставлениеОшибки);
		Сообщение.Сообщить();

		
	КонецЕсли; 
	
	
КонецПроцедуры

&НаСервере
Процедура ЗавершениеСопоставленияПоАртикулуНаСервере(Результат)
	
	ТЗ = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	
	Попытка
	
		ТоварыКСопоставлению.Загрузить(ТЗ);
				
		ОбщегоНазначения.СообщитьПользователю("Сопоставление по артикулу завершено");
	
	Исключение
		
		ОбщегоНазначения.СообщитьПользователю("Ошибка при сопоставлении товаров по артикулу. Подробное описание ошибки можно посмотреть в журнале регистрации");
		
		ЗаписьЖурналаРегистрации("Ошибка при сопоставлении товаров по артикулу", УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки(),);
		
	КонецПопытки;
	
	
КонецПроцедуры

#КонецОбласти

#Область СопоставлениеПоШтрихкоду

&НаКлиенте
Процедура СопоставитьПоШтрихкоду(Команда)
	Если ТоварыКСопоставлению.Количество() <> 0 Тогда
		
		ДлительнаяОперация     = СопоставитьПоШтрихкодуНаСервере();
		ПараметрыОжидания      = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьСообщения = Истина;
		ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
		ПараметрыОжидания.ТекстСообщения = "Сопоставление по штрихкоду ...";
		Оповещение = Новый ОписаниеОповещения("ЗавершениеСопоставленияПоШтрихкоду", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);	
		
	Иначе
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Перед сопоставлением по штрихкоду необходимо загрузить товары к сопоставлению";
		Сообщение.Сообщить();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция СопоставитьПоШтрихкодуНаСервере()
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор); 
	
	ВозвратныеДанные = ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, 
		"рар_мп_СопоставлениеТоваров.СопоставлениеПоШтрихкоду", ТоварыКСопоставлению.Выгрузить(), АккаунтМаркетплейса);
	
	Возврат ВозвратныеДанные;
	
КонецФункции

&НаКлиенте
Процедура ЗавершениеСопоставленияПоШтрихкоду(Результат, СтруктураПараметров) Экспорт
	
    Если Результат = НЕОПРЕДЕЛЕНО Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Ошибка при сопоставлении по штрихкоду";
		Сообщение.Сообщить();
		
		Возврат;	
	
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
	
		ЗавершениеСопоставленияПоШтрихкодуНаСервере(Результат);	
		
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон("Ошибка при сопоставлении по штрихкоду. Описание ошибки: %1", Результат.КраткоеПредставлениеОшибки);
		Сообщение.Сообщить();

		
	КонецЕсли; 
	
	
КонецПроцедуры

&НаСервере
Процедура ЗавершениеСопоставленияПоШтрихкодуНаСервере(Результат)
	
	ТЗ = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	
	Попытка
	
		ТоварыКСопоставлению.Загрузить(ТЗ);
				
		ОбщегоНазначения.СообщитьПользователю("Сопоставление по штрихкоду завершено");
	
	Исключение
		
		ОбщегоНазначения.СообщитьПользователю("Ошибка при сопоставлении товаров по штрихкоду. Подробное описание ошибки можно посмотреть в журнале регистрации");
		
		ЗаписьЖурналаРегистрации("Ошибка при сопоставлении товаров по штрихкоду", УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки(),);
		
	КонецПопытки;
	
	
КонецПроцедуры

#КонецОбласти
